{
  "experiences": [
    {
      "name": "How to Code: Simple Data",
      "link": "htc1x",
      "location": "Dhaka, Bangladesh",
      "weight": 4,
      "tags": [
        "course"
      ],
      "date": "January 2021 - February 2021",
      "short": "Took an AI course",
      "description": "This course is provided by the University of British Columbia on edX. Although aimed at beginners, this course teaches some very important design methods which may be unknown to a lot of self taught programmers. They teach methods (they call them 'recipes') for designing functions as well as data. A strong emphasis is placed on writing tests along with the functions which makes the structure of the functions much easier to determine. The course is taught using BSL (Beginner Student Language) which is a remarkably simple language. This forces us to rely on these design methods to create incredible programs, which would otherwise be very difficult.",
      "photos": [
        "/static/experiences/htc1x/img-1.jpg"
      ]
    },
    {
      "name": "CS50 AI",
      "link": "cs50-ai",
      "location": "Dhaka, Bangladesh",
      "weight": 3,
      "tags": [
        "course"
      ],
      "date": "April 2020 - May 2020",
      "short": "Took an AI course",
      "description": "This course is an another installment in the series of CS courses offered by Harvard. Going by the source it's excellence is already guaranteed, but it's much better than I had expected. The lectures are clear and concise and the projects are well engineered to make the concepts comprehensible. AI problems explored include: Search, Knowledge, Uncertainty, Optimization, Neural Networks, Language and Machine Learning.",
      "photos": [
        "/static/experiences/cs50ai/img-1.png"
      ]
    },
    {
      "name": "Python PH526x",
      "link": "python-ph526x",
      "location": "Dhaka, Bangladesh",
      "weight": 3,
      "tags": [
        "course"
      ],
      "date": "Feb 2020 - March 2020",
      "short": "Completed a course on using Python for Research",
      "description": "This course on edX explores the research capabilities of Python. Got familiar with Pandas, numpy and scipy to work with datasets in various ways. Explored regression, classification using k-nearest-neighbors and AI prediction",
      "photos": [
        "/static/experiences/python-ph526x/img-1.jpg"
      ]
    },
    {
      "name": "Malaysia Trip 2020",
      "link": "trip-2020",
      "location": "Malaysia",
      "weight": 2,
      "tags": [
        "travel"
      ],
      "date": "Dec 2019 - Jan 2020",
      "short": "Visited Malaysia with a friend",
      "description": "Spent the final night of the decade (New Year's Eve) in Kuala Lumpur, then spent a few beautiful days in Langkawi before returning back to Kuala Lumpur for some more adventures",
      "photos": [
        "/static/experiences/trip-2020/img-1.jpg"
      ]
    },
    {
      "name": "NC Tech Club",
      "link": "nc-techclub",
      "weight": 2,
      "location": "Dhaka, Bangladesh",
      "tags": [
        "course"
      ],
      "date": "July 2019 - Oct 2019",
      "short": "Polished my coding skills at a coding club",
      "description": "Spent some time at a coding club refining my coding skills. Learnt a lot of things(not limited to code) from the instructors",
      "photos": [
        "/static/experiences/nc-techclub/img-1.jpeg"
      ]
    },
    {
      "name": "CS50",
      "link": "cs50",
      "weight": 5,
      "location": "Dhaka, Bangladesh",
      "tags": [
        "course"
      ],
      "date": "2017 - 2018",
      "short": "Got my first taste of coding from this online course offered by Harvard on edX",
      "description": "At the beginning of 2017, I decided I would put my mind to it and learn programming. This course from Harvard equipped me with the foundation upon which I have built all of my coding skills",
      "photos": [
        "/static/experiences/cs50/img-1.jpg"
      ]
    },
    {
      "name": "CS5W",
      "link": "cs50w",
      "weight": 3,
      "location": "Dhaka, Bangladesh",
      "tags": [
        "course"
      ],
      "date": "2018 - 2019",
      "short": "Further developed my coding skills and dived deeper into web dev",
      "description": "Started this course right after completing CS50. This course is what first sparked my passion for web development",
      "photos": [
        "/static/experiences/cs50w/img-1.jpeg"
      ]
    }
  ]
}
